INSERT INTO userdetail (
    id,
    inpt_dt,
    wthdrw_dt,
    dept_cd,
    opos_cd,
    duty_cd,
    inpt_hnf_at,
    tcnc_grad_cd,
    remk500,
    user_nm,
    user_birt,
    user_agex,
    gndr_cd,
    post_no,
    detl_one_addr,
    detl_two_addr,
    detl_addr,
    hnpn_tel_no,
    eltr_mlad,
    file_path,
    dept_nm,
    user_id
) VALUES
-- 1
('6458736e-89f2-4103-bceb-1a3237228862', '20240801', '20260130', '100', '02', '01', '1', '1', 'pm',
 '김길동', '19900101', 35, 'M', '14303',
 '경기 광명시 범안로996번길 6 (하안동)', '티아모IT타워 1403호', '경기 광명시 범안로996번길 6 (하안동) 티아모IT타워 1403호',
 '010-6341-7895', 'kch@codesiin.co.kr', NULL, 'PM','demo1'),

-- 2
('bd83ac1b-1c80-49d7-9ca0-4cbd1a52808b', '20240801', '20260130', '101', '04', '02', '1', '3', NULL,
 '김연아', '19900508', 35, 'F', '33028',
 '충남 논산시 벌곡면 수락계곡길 8 (도산리)', NULL, '충남 논산시 벌곡면 수락계곡길 8 (도산리) ',
 '010-7777-7979', 'yak@codesiin.co.kr', NULL, '사업관리팀','demo2'),

-- 3
('9992215e-a4ca-42c0-b95d-e19e35da0d0f', '20250104', '20250530', '101', '04', '02', '1', NULL, NULL,
 '김영진', '19811017', 44, 'M', '06268',
 '서울 강남구 남부순환로361길 10 (도곡동, 언주빌라)', NULL, '서울 강남구 남부순환로361길 10 (도곡동, 언주빌라) ',
 '010-3906-4683', 'yjkim@neogene.co.kr', NULL, '사업관리팀','demo2'),

-- 4
('fd3e70c1-02b6-4e31-9cad-17a1974e36d6', '20240801', '20260130', '101', '02', '02', '1', '1', NULL,
 '김춘호', '19760429', 49, 'M', '08608',
 '서울 금천구 벚꽃로 30 (독산동, 금천 롯데캐슬 골드파크 2차)', NULL, '서울 금천구 벚꽃로 30 (독산동, 금천 롯데캐슬 골드파크 2차) ',
 NULL, 'kch@codesiin.co.kr', '/PRM/PHOTO', '사업관리팀','demo4'),

-- 5
('074b53e2-1831-4e83-bf66-f37d1368c1c4', '20250805', '20251231', '101', '07', '06', '1', '4', NULL,
 '하지연', NULL, NULL, 'F', NULL,
 NULL, NULL, NULL,
 NULL, NULL, NULL, '사업관리팀','demo5'),

-- 6
('cd634877-d7d3-4eb3-9086-22c65e579ca3', '20240801', '20260130', '102', '04', '06', '1', NULL, NULL,
 '지미경', '19890914', 36, 'F', '06267',
 '서울 강남구 강남대로 246 (도곡동, 다림빌딩)', NULL, '서울 강남구 강남대로 246 (도곡동, 다림빌딩) ',
 '010-1018-0240', 'mkji@neogene.co.kr', NULL, '품질관리팀','demo6'),

-- 7
('79be6d14-e4a3-4655-b689-788e544c26b9', '20240801', '20260130', '102', '03', '03', '1', NULL, NULL,
 '최상현', '19800314', 45, 'M', '06035',
 '서울 강남구 가로수길 5 (신사동)', NULL, '서울 강남구 가로수길 5 (신사동) ',
 '010-1711-0376', 'shchoi2@neogene.co.kr', NULL, '품질관리팀','demo7'),

-- 8
('b6519dde-aec2-4e6f-9933-ff57ba9cf4ae', '20250212', '20250607', '103', '05', '05', '1', '3', NULL,
 '김옥자', '19820707', 43, 'F', '05556',
 '서울 송파구 백제고분로7길 3 (잠실동)', NULL, '서울 송파구 백제고분로7길 3 (잠실동) ',
 '010-9647-8954', 'ojkim@neogene.co.kr', NULL, '인프라/표준화팀','demo8'),

-- 9
('10e08e6a-973c-4243-9bd4-7ad83f754462', '20250516', '20250814', '103', '04', '04', '1', NULL, NULL,
 '이아름', '19930921', 32, 'F', '05700',
 '서울 송파구 양재대로68길 3 (가락동, 동방빌라)', NULL, '서울 송파구 양재대로68길 3 (가락동, 동방빌라) ',
 '010-4706-8708', 'arlee@demo.co.kr', NULL, '인프라/표준화팀','demo9'),

-- 10
('dc320c2a-e4b6-489c-8dd1-d80ec43ecb1e', '20250425', '20251013', '103', '06', '06', '1', NULL, NULL,
 '이지훈', '19910513', 34, 'M', '06000',
 '서울 강남구 강남대로 708 (압구정동, 한남대교레인보우카폐)', NULL, '서울 강남구 강남대로 708 (압구정동, 한남대교레인보우카폐) ',
 '010-1972-8788', 'jh35@neogene.com', NULL, '인프라/표준화팀','demo10'),

-- 11
('76c990c5-9ec3-414c-9a32-b2d716e41105', '20240801', '20260130', '103', '02', '03', '1', '1', NULL,
 '장성환', '19830812', 42, 'M', '14989',
 '경기 시흥시 목감남서로 92-12 (산현동, 호수품애)', NULL, '경기 시흥시 목감남서로 92-12 (산현동, 호수품애) ',
 '010-3802-5791', 'jsh@codesiin.co.kr', NULL, '인프라/표준화팀','demo11'),

-- 12
('8cb0cce3-7635-4a2a-91d5-8a4f7793fd84', '20250630', '20250930', '103', '07', '04', '1', NULL, NULL,
 '최성호', '19980823', 27, 'M', '06307',
 '서울 강남구 개포로 204 (개포동)', NULL, '서울 강남구 개포로 204 (개포동) ',
 '010-2301-7704', 'shchoi@neogene.co.kr', NULL, '인프라/표준화팀','demo12'),

-- 13
('3cfe22ba-f1f0-4632-a688-e0fe6a2a5526', '20240801', '20260130', '103', '04', '06', '1', '1', NULL,
 '최흥규', '19870830', 38, 'M', '08619',
 '서울 금천구 시흥대로94길 50 (독산동, 롯데블르빌3차)', NULL, '서울 금천구 시흥대로94길 50 (독산동, 롯데블르빌3차) ',
 '010-2445-1098', 'chg@codesiin.co.kr', '/PRM/PHOTO', '인프라/표준화팀','demo13'),

-- 14
('1841c53e-9c4f-421d-a2e2-694b5ad25802', '20250217', '20250627', '105', '03', '07', '1', NULL, NULL,
 '김성호', '19970921', 28, 'M', '06748',
 '서울 서초구 양재천로 107-4 (양재동, 양재천가)', NULL, '서울 서초구 양재천로 107-4 (양재동, 양재천가) ',
 '010-2893-2016', 'shkim@neogene.co.kr', NULL, 'UI/UX팀','demo14'),

-- 15
('a99d2e84-d3e0-4001-b452-c93b4e02ec8c', '20250321', '20250619', '105', '07', '05', '1', NULL, NULL,
 '김옥순', '19890617', 36, 'F', '16262',
 '경기 수원시 팔달구 수원천로 245 (영동)', NULL, '경기 수원시 팔달구 수원천로 245 (영동) ',
 '010-4181-2506', 'oskim@neogene.co.kr', NULL, 'UI/UX팀','demo15'),

-- 16
('b220c80a-a107-488d-938a-e2ce1fda793f', '20240801', '20260130', '105', '05', '07', '1', '3', NULL,
 '이푸름', '19900508', 35, 'F', '27687',
 '충북 음성군 음성읍 덕생로728번길 89-8 (초천리)', NULL, '충북 음성군 음성읍 덕생로728번길 89-8 (초천리) ',
 NULL, 'lpr@codesiin.co.kr', '/PRM/PHOTO', 'UI/UX팀','demo16'),

-- 17
('e937d458-e01e-44f4-bd90-ef6866a10f63', '20240801', '20260130', '105', '03', '03', '1', '2', NULL,
 '인스웨이브', '20020401', 23, 'M', '07339',
 '서울 영등포구 국제금융로 39 (여의도동, 브라이튼 여의도)', NULL, '서울 영등포구 국제금융로 39 (여의도동, 브라이튼 여의도) ',
 '010-4755-0667', 'inswave@inswave.com', '/PRM/PHOTO', 'UI/UX팀','demo17'),

-- 18
('77f09d24-c12e-4392-ac51-36580b2e832a', '20250321', '20250623', '105', '05', '08', '1', NULL, NULL,
 '장지훈', '19980924', 27, 'M', '07241',
 '서울 영등포구 여의공원로 119 (여의도동)', NULL, '서울 영등포구 여의공원로 119 (여의도동) ',
 '010-3705-0014', 'jhjang@neo.co.kr', NULL, 'UI/UX팀','demo18'),

-- 19
('8df77753-0351-401d-9e72-9796a46ef6ba', '20240801', '20260130', '110', '05', '05', '1', NULL, NULL,
 '권진우', '19940914', 31, 'M', '46758',
 '부산 강서구 르노삼성대로 61 (신호동)', NULL, '부산 강서구 르노삼성대로 61 (신호동) ',
 '010-4388-4059', 'jwkwon@neogene.co.kr', NULL, '개발1팀','demo19'),

-- 20
('c44fef10-7be0-439c-9c4f-d356693384e9', '20250621', '20251205', '110', '04', '06', '1', NULL, NULL,
 '김민지', '19921015', 33, 'F', '06253',
 '서울 강남구 강남대로 302 (역삼동, 동희빌딩)', NULL, '서울 강남구 강남대로 302 (역삼동, 동희빌딩) ',
 '010-2626-7092', 'mjkim@neogene.co.kr', NULL, '개발1팀','demo20'),

-- 21
('7249e13d-2ea3-44a3-84c6-fdae18b63b7e', '20250403', '20250809', '110', '03', '06', '1', NULL, NULL,
 '류채원', '19811213', 43, 'F', '06170',
 '서울 강남구 봉은사로 지하 601 (삼성동, 봉은사역)', NULL, '서울 강남구 봉은사로 지하 601 (삼성동, 봉은사역) ',
 '010-7381-9378', 'cwryu@neogene.co.kr', NULL, '개발1팀','demo21'),

-- 22
('4b9d5a70-d157-4035-9185-396f53d845fd', '20250322', '20251231', '110', '03', '06', '1', NULL, NULL,
 '문준서', '19880330', 37, 'F', '06307',
 '서울 강남구 개포로 204 (개포동)', NULL, '서울 강남구 개포로 204 (개포동) ',
 '010-7781-0335', 'jsmoon@neogene.co.kr', NULL, '개발1팀','demo22'),

-- 23
('a2642199-8d4f-42ac-aa28-4f452470bbd1', '20250516', '20251231', '110', '04', '06', '1', NULL, NULL,
 '성진호', '19870620', 38, 'M', '07241',
 '서울 영등포구 여의공원로 111 (여의도동, 여의도 태영빌딩)', NULL, '서울 영등포구 여의공원로 111 (여의도동, 여의도 태영빌딩) ',
 '010-5519-3217', 'jhsung@neogene.co.kr', NULL, '개발1팀','demo42'),

-- 24
('413399c1-d2bc-4539-8088-14523ae683e0', '20240801', '20260130', '110', '03', '03', '1', '1', NULL,
 '손흥민', '19800101', 45, 'M', '05693',
 '서울 송파구 가락로 6 (석촌동)', NULL, '서울 송파구 가락로 6 (석촌동) ',
 '010-2345-6789', 'son@codesiin.co.kr', NULL, '개발1팀','demo23'),

-- 25
('fc4b47fe-102a-46e5-abb3-39e9f8f07dd0', '20240801', '20260130', '110', '05', '06', '1', NULL, NULL,
 '하정남', '19960908', 29, 'M', '06711',
 '서울 서초구 반포대로1길 11 (서초동, 벽산서초블루밍)', NULL, '서울 서초구 반포대로1길 11 (서초동, 벽산서초블루밍) ',
 '010-7356-3756', 'jnha@neogene.co.kr', NULL, '개발1팀','demo24'),

-- 26
('dd5cb1f5-47cc-4c8a-9d49-fe8d4e72474a', '20250624', '20251011', '111', '04', '06', '1', NULL, NULL,
 '김건우', '19901125', 34, 'M', '12732',
 '경기 광주시 초월읍 학동리 325', NULL, '경기 광주시 초월읍 학동리 325 ',
 '010-5147-9422', 'kwkim@neogene.co.kr', NULL, '개발2팀','demo25'),

-- 27
('36a265f3-6ab3-47ea-9a3c-b18254416238', '20250404', '20250721', '111', '03', '06', '1', '2', NULL,
 '김영숙', '19820709', 43, 'F', '06087',
 '서울 강남구 영동대로115길 11 (삼성동, 봉은빌리지)', NULL, '서울 강남구 영동대로115길 11 (삼성동, 봉은빌리지) ',
 '010-1798-0675', 'yskim@demo.co.kr', NULL, '개발2팀','demo26'),

-- 28
('5e76ba8f-fabc-49b5-adfd-fe894a0a671c', '20250115', '20251231', '111', '03', '06', '1', NULL, NULL,
 '김준서', '19830728', 42, 'F', '08500',
 '서울 금천구 가산동 535-132', NULL, '서울 금천구 가산동 535-132 ',
 '010-2101-6349', 'jskim@neogene.co.kr', NULL, '개발2팀','demo27'),

-- 29
('256e2bf1-f803-4b3f-b6d9-f13cafcea173', '20240801', '20260130', '111', '05', '03', '1', '3', NULL,
 '김준식', '19900508', 35, 'M', '16332',
 '경기 수원시 장안구 만석로68번길 10 (정자동, 백설마을 현대.코오롱아파트)', NULL, '경기 수원시 장안구 만석로68번길 10 (정자동, 백설마을 현대.코오롱아파트) ',
 '01028255984', 'kjs@codesiin.co.kr', NULL, '개발2팀','demo28'),

-- 30
('6be78c22-64cf-40c2-94c2-33b6108970a2', '20250301', '20251231', '111', '03', '05', '1', NULL, NULL,
 '김지우', '19870203', 38, 'F', '05200',
 '서울 강동구 가래여울2길 31 (강일동)', NULL, '서울 강동구 가래여울2길 31 (강일동) ',
 '010-4782-9152', 'jwkim@gene.co.kr', NULL, '개발2팀','demo29'),

-- 31
('8dbf9f4c-a988-4ac4-8dbb-0c9f9dcdb521', '20250107', '20250318', '111', '05', '06', '1', '3', NULL,
 '박주원', '19910502', 34, 'F', '06568',
 '서울 서초구 서초대로1길 2 (방배동, 방배한진로즈힐아파트)', NULL, '서울 서초구 서초대로1길 2 (방배동, 방배한진로즈힐아파트) ',
 '010-2703-5745', 'jwpark@neogene.co.kr', NULL, '개발2팀','demo30'),

-- 32
('f3635bdc-939e-4d34-a914-096d313b9890', '20240801', '20260130', '111', '03', '06', '1', NULL, NULL,
 '이성진', '19800126', 45, 'M', '04184',
 '서울 마포구 효창원로98길 5 (공덕동)', NULL, '서울 마포구 효창원로98길 5 (공덕동) ',
 '010-0403-8244', 'sjlee@neogene.co.kr', NULL, '개발2팀','demo31'),

-- 33
('de239d63-3c19-429e-95e7-fe2052e2a4eb', '20250605', '20251231', '111', '03', '06', '1', NULL, NULL,
 '이정식', '19831206', 41, 'M', '61763',
 '광주 남구 판촌길 23-4 (양촌동)', NULL, '광주 남구 판촌길 23-4 (양촌동) ',
 '010-2951-4390', 'jslee@neo.com', NULL, '개발2팀','demo32'),

-- 34
('2eec6c1f-2703-4f63-8e99-503245c1518c', '20250606', '20251125', '111', '03', '06', '1', NULL, NULL,
 '허민재', '19860520', 39, 'M', '06313',
 '서울 강남구 논현로 4 (개포동)', NULL, '서울 강남구 논현로 4 (개포동) ',
 '010-3609-7617', 'mjheo@neogene.co.kr', NULL, '개발2팀','demo33'),

-- 35
('18633849-359c-4289-821b-c741c0f3f0aa', '20250108', '20251231', '112', '04', '06', '1', NULL, NULL,
 '김명숙', '19960518', 29, 'F', '06779',
 '서울 서초구 강남대로 48-10 (양재동)', NULL, '서울 서초구 강남대로 48-10 (양재동) ',
 '010-2499-1455', 'mskim@neogene.co.kr', NULL, '개발3팀','demo34'),

-- 36
('c16ff275-0587-4ec7-a34a-6de0b70f9b49', '20250624', '20251231', '112', '05', '06', '1', NULL, NULL,
 '김상훈', '19900909', 35, 'M', '07061',
 '서울 동작구 보라매로 61 (신대방동)', NULL, '서울 동작구 보라매로 61 (신대방동) ',
 '010-4494-8959', 'shkim2@neogene.co.kr', NULL, '개발3팀','demo35'),

-- 37
('be08356e-b84f-4259-8878-0e6653c71def', '20250212', '20250607', '112', '05', '06', '1', NULL, NULL,
 '박지훈', '19901207', 34, 'M', '05564',
 '서울 송파구 석촌호수로12길 1-6 (잠실동)', NULL, '서울 송파구 석촌호수로12길 1-6 (잠실동) ',
 '010-1525-2409', 'jhpark@neogene.co.kr', NULL, '개발3팀','demo36'),

-- 38
('768792d9-8fc2-4b14-8c3f-7a1f464467cb', '20240801', '20260130', '112', '04', '06', '1', '1', NULL,
 '복주혜', '19900610', 35, 'F', '13994',
 '경기 안양시 만안구 안양천서로 311 (안양동, 삼성래미안아파트)', NULL, '경기 안양시 만안구 안양천서로 311 (안양동, 삼성래미안아파트) ',
 '010-4504-7551', 'bjh@codesiin.co.kr', '/PRM/PHOTO', '개발3팀','demo37'),

-- 39
('52b16881-6262-44cb-a980-6ee9e76130bd', '20240801', '20260130', '112', '03', '03', '1', NULL, NULL,
 '안예진', '19800313', 45, 'F', '06307',
 '서울 강남구 개포로 204 (개포동)', NULL, '서울 강남구 개포로 204 (개포동) ',
 '010-1239-1387', 'yjan@neo.co.kr', NULL, '개발3팀','demo38'),

-- 40
('b8e526d4-da1b-477a-a23b-509edc7656f8', '20250530', '20251009', '112', '05', '06', '1', NULL, NULL,
 '최지원', '19900404', 35, 'F', '15874',
 '경기 군포시 삼성로 5 (부곡동, 해피시티)', NULL, '경기 군포시 삼성로 5 (부곡동, 해피시티) ',
 '010-2701-9966', 'jwchoi@neogene.co.kr', NULL, '개발3팀','demo39'),

-- 41
('d9ed9295-150c-4eed-9030-352c6e283f0c', '20250424', '20250807', '112', '06', '06', '1', NULL, NULL,
 '황영순', '19990704', 26, 'F', '06232',
 '서울 강남구 테헤란로4길 6 (역삼동, 강남역 센트럴 푸르지오 시티)', NULL, '서울 강남구 테헤란로4길 6 (역삼동, 강남역 센트럴 푸르지오 시티) ',
 '010-9605-4941', 'yshwang@neogene.co.kr', NULL, '개발3팀','demo40'),

-- 42
('ae0cf346-2a50-4f96-86f4-ead304391d6d', NULL, NULL, NULL, NULL, NULL, '0', '1', NULL,
 '백승진', NULL, NULL, 'M', NULL,
 NULL, NULL, NULL,
 '010-6826-7777', 'iiback@inswave.com', NULL, NULL,'demo41');
